tap "davidalger/warden"
tap "havoc-io/mutagen"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "wardenenv/warden"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# OpenType text shaping engine
brew "harfbuzz"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Platform built on V8 to build network applications
brew "node"
# General-purpose scripting language
brew "php"
# Monitor data's progress through a pipe
brew "pv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Utility that provides fast incremental file transfer
brew "rsync"
# Cross-shell prompt for astronauts
brew "starship"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Fast file synchronization and network forwarding for remote development
brew "havoc-io/mutagen/mutagen"
# Warden is a CLI utility for working with docker-compose environments
brew "wardenenv/warden/warden"
# Application launcher and productivity software
cask "alfred"
# Application uninstaller
cask "appcleaner"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Server and cloud storage browser
cask "cyberduck"
# App to build and share containerized applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Typeface made for developers
cask "font-jetbrains-mono"
# Utility to provide quick look previews for files that aren't natively supported
cask "glance"
# Web browser
cask "google-chrome"
# Free and open-source media player
cask "iina"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Tool to create and manage Outline servers, powered by Shadowsocks
cask "outline-manager"
# Allows users with an iSight (or compatible) camera to read QR codes
cask "qr-journal"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Video chat, voice call and instant messaging application
cask "skype"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Quicklook extension for source files
cask "syntax-highlight"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Messaging app with a focus on speed and security
cask "telegram"
# Unpacks archive files
cask "the-unarchiver"
# Web browser focusing on security
cask "tor-browser"
# Open-source BitTorrent client
cask "transmission"
# VPN client for secure internet access and private browsing
cask "tunnelbear"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "zoom"
vscode "aaron-bond.better-comments"
vscode "azemoh.one-monokai"
vscode "bmewburn.vscode-intelephense-client"
vscode "christian-kohler.path-intellisense"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "mikestead.dotenv"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "PKief.material-icon-theme"
vscode "streetsidesoftware.code-spell-checker"
