tap "davidalger/warden"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Isolated development environments using Docker
brew "docker-compose"
# Platform built on V8 to build network applications
brew "node"
# Monitor data's progress through a pipe
brew "pv"
# Cross-shell prompt for astronauts
brew "starship"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Warden is a CLI utility for working with docker-compose environments
brew "davidalger/warden/warden"
# Application uninstaller
cask "appcleaner"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# App to build and share containerized applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Typeface made for developers
cask "font-jetbrains-mono"
# Utility to provide quick look previews for files that aren't natively supported
cask "glance"
# Web browser
cask "google-chrome"
# Free and open-source media player
cask "iina"
# File system integration
cask "macfuse"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organized
cask "notion"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Video chat, voice call and instant messaging application
cask "skype"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Quicklook extension for source files
cask "syntax-highlight"
# Messaging app with a focus on speed and security
cask "telegram"
# Open-source BitTorrent client
cask "transmission"
# Disk encryption software focusing on security based on TrueCrypt
cask "veracrypt"
# Open-source code editor
cask "visual-studio-code"
# VPN client for secure internet access and private browsing
cask "windscribe"
# Video communication and virtual meeting platform
cask "zoom"
